package lesson5;

public class MathUtils {
    /**
     * 1 - модификатор доступа ( 1 из 4х вариантов слов)
     * public - видимость внутри всего проекта
     * protected - видимость внутри текущего класса + наследникам текущего проекта
     * ________ - видимость внутри текущего пакета
     * private - видимость внутри текущего класса
     * 2 - static (пишется или нет)
     * 3 - возвращаемый тип (int, double, char,string) void - если нет возвращаемого типа
     * 4 - название метода
     * 5 - входящие параметры в круглых скобках через запятую, указываем
     * тип и название переменной
     * 6 - тело выполнения метода (то что будет выполнено если вызвать данный метод)
     */



    //метод будет принимать входящими три стороны треугольника
    //и возвращать площадь







}


